app/controllers/games_controller.rb

SELECT * FROM "moves" WHERE ("moves"."game_id" = 2 AND "moves"."player_id" = 1) LIMIT 1
UPDATE "moves" SET "updated_at" = '2010-04-06 19:38:15', "choice" = 'paper' WHERE "id" = 2
---
  def move

    if request.post?

      @g = Game.find(params[:game_id])
      @me = Player.find(session[:player_id])

      @m = Move.first(
        :conditions=>["game_id = ? and player_id = ?", @g.id, @me.id])

      @m.choice = params[:choice]
      @m.save