app/controllers/games_controller.rb

  def invite

    if request.post?
      @me = Player.find(session[:player_id])
---
SELECT * FROM "players" WHERE ("players"."id" = 2)

  def accept

    if request.post?
      @me = Player.find session[:player_id]
      @g = Game.find params[:game_id]
---
SELECT * FROM "players" WHERE ("players"."id" = 3)
SELECT * FROM "games" WHERE ("games"."id" = 18)

  def play

    @g = Game.find(params[:id])
    @pagetitle = "Game #{@g.id} #{@g.status}"
    @me = Player.find(session[:player_id])
---
SELECT * FROM "games" WHERE ((inviter_id = 2 or invited_id = 2) and status in ('invitation accepted', 'in progress'))
SELECT * FROM "players" WHERE (logged_in is not null and id != 3)

  def move

    if request.post?

      @g = Game.find(params[:game_id])
      @me = Player.find(session[:player_id])
---
SELECT * FROM "games" WHERE ("games"."id" = 0)
SELECT * FROM "players" WHERE ("players"."id" = 2)

  def my_unfinished_games
    @me = Player.find(session[:player_id])
---
SELECT * FROM "players" WHERE (logged_in is not null and id != 3)