app/controllers/invites_controller.rb

SELECT * FROM "players" WHERE ("players"."id" = 2)
---
  def received

    @pagetitle = "Invites sent to me"
    @me = Player.find(session[:player_id])

SELECT * FROM "games" WHERE ("games"."id" = 13)
---
  def accept

    if request.post?

      me = Player.find(session[:player_id])
      g = Game.find(params['gID'])