app/controllers/invites_controller.rb

SELECT * FROM "players" WHERE ("players"."id" = 1)
---
  def invite

    if request.post?

      Invite.send_invite(session[:player_id], params[:to_player])

      to_player = Player.find(params[:to_player])

SELECT * FROM "invites" WHERE (to_player_id = NULL)
---
  def received

    @pagetitle = "Invites sent to me"

    @invites_sent_to_me = Invite.all(
      :conditions=>["to_player_id = ?", session[:player_id]])

SELECT * FROM "players" WHERE ("players"."id" = 2)
SELECT * FROM "invites" WHERE ("invites"."id" = 6)
INSERT INTO "games" ("invited_id", "created_at", "updated_at", "theme_id", "inviter_id", "winner_id", "inviter_move", "accepted", "status", "invited_move") VALUES(NULL, '2010-04-11 21:37:37', '2010-04-11 21:37:37', NULL, NULL, NULL, NULL, 'f', NULL, NULL)
INSERT INTO "moves" ("created_at", "updated_at", "choice", "player_id", "game_id") VALUES('2010-04-08 18:53:34', '2010-04-08 18:53:34', NULL, 1, 2)
UPDATE "games" SET "updated_at" = '2010-04-12 00:58:24', "accepted" = 't', "status" = 'invitation accepted' WHERE "id" = 13
DELETE FROM "invites" WHERE "id" = 6
---
  def accept

    if request.post?

      me = Player.find(session[:player_id])
      inv = Invite.find(params['invID'])

      g = Game.new.save

      Move.new(:game_id=>g.id, :player_id=>me.id).save
      Move.new(:game_id=>g.id, :player_id=>inv.from_player_id).save

      inv.destroy