app/controllers/matt_controller.rb

SELECT * FROM "players" WHERE ("players"."password" = '1234' AND "players"."login" = 'matt') LIMIT 1
UPDATE "players" SET "updated_at" = '2010-04-04 20:21:53', "logged_in" = '2010-04-04 20:21:53' WHERE "id" = 2
---
  def login

    @pagetitle = "Log in"

    if request.post?

      p = Player.find_by_login_and_password(
        params['login'], params['password'])

      if p.nil?
          flash[:notice] = "Sorry, bad credentials"

      else
          flash[:notice] = "Hi #{p.login} -- welcome!"
          p.logged_in = DateTime.now
          p.save # Apparently, this is pretty important :)

SELECT * FROM "players" WHERE ("players"."id" = 1)
---
  def logout

    @me = Player.find session[:player_id]