app/controllers/players_controller.rb

  def received
    @me = Player.find(session[:player_id])
---
SELECT * FROM "players" WHERE (logged_in is not null and id != 3)

  def login

    if session[:player_id]
      return redirect_to :controller => 'players', :action => 'others'
    end

    @pagetitle = "Log in"

    if request.post?

      p = Player.find_by_login_and_password(
        params['login'], params['password'])

      if p.nil?
          flash[:notice] = "Sorry, bad credentials"

      else
          flash[:notice] = "Hi #{p.login} -- welcome!"
          p.logged_in = DateTime.now
          p.save
---
SELECT * FROM "players" WHERE ("players"."password" = '1234' AND "players"."login" = 'matt') LIMIT 1
UPDATE "players" SET "updated_at" = '2010-04-13 19:24:52', "logged_in" = '2010-04-13 19:24:52' WHERE "id" = 2

  def logout

    @me = Player.find session[:player_id]
---
SELECT * FROM "players" WHERE (logged_in is not null and id != 2)

  def others

    @pagetitle = "Other logged-in players"

    @me = Player.find session[:player_id]

    @players = @me.other_logged_in_players

    @invited = @me.delivered_invites.map do |p| p.invited end
---
SELECT * FROM "players" WHERE (logged_in is not null and id != 2)
SELECT * FROM "invites" WHERE (from_player_id = 2)

  def leaderboard

    if session[:player_id]
      @me = Player.find session[:player_id]
---
SELECT * FROM "players" WHERE (logged_in is not null and id != 2)